zephyrproject-rtos/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl702lx-pinctrl.h
/* gpio9_clock_out1_xtal32k */
#define GPIO9_CLOCK_OUT1_XTAL32K \
	BFLB_PINMUX(9, clock_out1, xtal32k, periph)

/* gpio9_spi_miso */
#define GPIO9_SPI_MISO \
	BFLB_PINMUX(9, spi, miso, periph)

/* gpio9_i2c_sda */
#define GPIO9_I2C_SDA \
	BFLB_PINMUX(9, i2c, sda, periph)

/* gpio9_uart0_rts */
#define GPIO9_UART0_RTS \
	BFLB_PINMUX(9, uart0, rts, periph)

/* gpio9_uart0_cts */
#define GPIO9_UART0_CTS \
	BFLB_PINMUX(9, uart0, cts, periph)

/* gpio9_uart0_tx */
#define GPIO9_UART0_TX \
	BFLB_PINMUX(9, uart0, tx, periph)

/* gpio9_uart0_rx */
#define GPIO9_UART0_RX \
	BFLB_PINMUX(9, uart0, rx, periph)

/* gpio9_pwm1_ch3 */
#define GPIO9_PWM1_CH3 \
	BFLB_PINMUX(9, pwm1, ch3, periph)

/* gpio9_jtag_tdi */
#define GPIO9_JTAG_TDI \
	BFLB_PINMUX(9, jtag, tdi, periph)

/* gpio9_adc_ch9 */
#define GPIO9_ADC_CH9 \
	BFLB_PINMUX(9, adc, ch9, analog)

/* gpio10_clock_out0_dll_2_032M */
#define GPIO10_CLOCK_OUT0_DLL_2_032M \
	BFLB_PINMUX(10, clock_out0, dll_2_032m, periph)

/* gpio10_clock_out0_dll_6_095M */
#define GPIO10_CLOCK_OUT0_DLL_6_095M \
	BFLB_PINMUX(10, clock_out0, dll_6_095m, periph)

/* gpio10_clock_out0_xclk */
#define GPIO10_CLOCK_OUT0_XCLK \
	BFLB_PINMUX(10, clock_out0, xclk, periph)

/* gpio10_spi_ss */
#define GPIO10_SPI_SS \
	BFLB_PINMUX(10, spi, ss, periph)

/* gpio10_i2c_scl */
#define GPIO10_I2C_SCL \
	BFLB_PINMUX(10, i2c, scl, periph)

/* gpio10_uart0_rts */
#define GPIO10_UART0_RTS \
	BFLB_PINMUX(10, uart0, rts, periph)

/* gpio10_uart0_cts */
#define GPIO10_UART0_CTS \
	BFLB_PINMUX(10, uart0, cts, periph)

/* gpio10_uart0_tx */
#define GPIO10_UART0_TX \
	BFLB_PINMUX(10, uart0, tx, periph)

/* gpio10_uart0_rx */
#define GPIO10_UART0_RX \
	BFLB_PINMUX(10, uart0, rx, periph)

/* gpio10_pwm0_ch0 */
#define GPIO10_PWM0_CH0 \
	BFLB_PINMUX(10, pwm0, ch0, periph)

/* gpio10_jtag_tck */
#define GPIO10_JTAG_TCK \
	BFLB_PINMUX(10, jtag, tck, periph)

/* gpio11_clock_out1_f32k */
#define GPIO11_CLOCK_OUT1_F32K \
	BFLB_PINMUX(11, clock_out1, f32k, periph)

/* gpio11_clock_out1_xtal */
#define GPIO11_CLOCK_OUT1_XTAL \
	BFLB_PINMUX(11, clock_out1, xtal, periph)

/* gpio11_clock_out1_xtal32k */
#define GPIO11_CLOCK_OUT1_XTAL32K \
	BFLB_PINMUX(11, clock_out1, xtal32k, periph)

/* gpio11_spi_sclk */
#define GPIO11_SPI_SCLK \
	BFLB_PINMUX(11, spi, sclk, periph)

/* gpio11_i2c_sda */
#define GPIO11_I2C_SDA \
	BFLB_PINMUX(11, i2c, sda, periph)

/* gpio11_uart0_rts */
#define GPIO11_UART0_RTS \
	BFLB_PINMUX(11, uart0, rts, periph)

/* gpio11_uart0_cts */
#define GPIO11_UART0_CTS \
	BFLB_PINMUX(11, uart0, cts, periph)

/* gpio11_uart0_tx */
#define GPIO11_UART0_TX \
	BFLB_PINMUX(11, uart0, tx, periph)

/* gpio11_uart0_rx */
#define GPIO11_UART0_RX \
	BFLB_PINMUX(11, uart0, rx, periph)

/* gpio11_pwm1_ch0 */
#define GPIO11_PWM1_CH0 \
	BFLB_PINMUX(11, pwm1, ch0, periph)

/* gpio11_jtag_tdo */
#define GPIO11_JTAG_TDO \
	BFLB_PINMUX(11, jtag, tdo, periph)

/* gpio11_adc_ch10 */
#define GPIO11_ADC_CH10 \
	BFLB_PINMUX(11, adc, ch10, analog)

/* gpio14_clock_out0_dll_2_032M */
#define GPIO14_CLOCK_OUT0_DLL_2_032M \
	BFLB_PINMUX(14, clock_out0, dll_2_032m, periph)

/* gpio14_clock_out0_dll_6_095M */
#define GPIO14_CLOCK_OUT0_DLL_6_095M \
	BFLB_PINMUX(14, clock_out0, dll_6_095m, periph)

/* gpio14_clock_out0_xclk */
#define GPIO14_CLOCK_OUT0_XCLK \
	BFLB_PINMUX(14, clock_out0, xclk, periph)

/* gpio14_spi_ss */
#define GPIO14_SPI_SS \
	BFLB_PINMUX(14, spi, ss, periph)

/* gpio14_i2c_scl */
#define GPIO14_I2C_SCL \
	BFLB_PINMUX(14, i2c, scl, periph)

/* gpio14_uart0_rts */
#define GPIO14_UART0_RTS \
	BFLB_PINMUX(14, uart0, rts, periph)

/* gpio14_uart0_cts */
#define GPIO14_UART0_CTS \
	BFLB_PINMUX(14, uart0, cts, periph)

/* gpio14_uart0_tx */
#define GPIO14_UART0_TX \
	BFLB_PINMUX(14, uart0, tx, periph)

/* gpio14_uart0_rx */
#define GPIO14_UART0_RX \
	BFLB_PINMUX(14, uart0, rx, periph)

/* gpio14_pwm1_ch3 */
#define GPIO14_PWM1_CH3 \
	BFLB_PINMUX(14, pwm1, ch3, periph)

/* gpio14_jtag_tck */
#define GPIO14_JTAG_TCK \
	BFLB_PINMUX(14, jtag, tck, periph)

/* gpio14_adc_ch0 */
#define GPIO14_ADC_CH0 \
	BFLB_PINMUX(14, adc, ch0, analog)

/* gpio15_clock_out1_f32k */
#define GPIO15_CLOCK_OUT1_F32K \
	BFLB_PINMUX(15, clock_out1, f32k, periph)

/* gpio15_clock_out1_xtal */
#define GPIO15_CLOCK_OUT1_XTAL \
	BFLB_PINMUX(15, clock_out1, xtal, periph)

/* gpio15_clock_out1_xtal32k */
#define GPIO15_CLOCK_OUT1_XTAL32K \
	BFLB_PINMUX(15, clock_out1, xtal32k, periph)

/* gpio15_spi_sclk */
#define GPIO15_SPI_SCLK \
	BFLB_PINMUX(15, spi, sclk, periph)

/* gpio15_i2c_sda */
#define GPIO15_I2C_SDA \
	BFLB_PINMUX(15, i2c, sda, periph)

/* gpio15_uart0_rts */
#define GPIO15_UART0_RTS \
	BFLB_PINMUX(15, uart0, rts, periph)

/* gpio15_uart0_cts */
#define GPIO15_UART0_CTS \
	BFLB_PINMUX(15, uart0, cts, periph)

/* gpio15_uart0_tx */
#define GPIO15_UART0_TX \
	BFLB_PINMUX(15, uart0, tx, periph)

/* gpio15_uart0_rx */
#define GPIO15_UART0_RX \
	BFLB_PINMUX(15, uart0, rx, periph)

/* gpio15_pwm0_ch0 */
#define GPIO15_PWM0_CH0 \
	BFLB_PINMUX(15, pwm0, ch0, periph)

/* gpio15_jtag_tdo */
#define GPIO15_JTAG_TDO \
	BFLB_PINMUX(15, jtag, tdo, periph)

/* gpio15_adc_ch1 */
#define GPIO15_ADC_CH1 \
	BFLB_PINMUX(15, adc, ch1, analog)

/* gpio16_clock_out0_dll_2_032M */
#define GPIO16_CLOCK_OUT0_DLL_2_032M \
	BFLB_PINMUX(16, clock_out0, dll_2_032m, periph)

/* gpio16_clock_out0_dll_6_095M */
#define GPIO16_CLOCK_OUT0_DLL_6_095M \
	BFLB_PINMUX(16, clock_out0, dll_6_095m, periph)

/* gpio16_clock_out0_xclk */
#define GPIO16_CLOCK_OUT0_XCLK \
	BFLB_PINMUX(16, clock_out0, xclk, periph)

/* gpio16_spi_mosi */
#define GPIO16_SPI_MOSI \
	BFLB_PINMUX(16, spi, mosi, periph)

/* gpio16_i2c_scl */
#define GPIO16_I2C_SCL \
	BFLB_PINMUX(16, i2c, scl, periph)

/* gpio16_uart0_rts */
#define GPIO16_UART0_RTS \
	BFLB_PINMUX(16, uart0, rts, periph)

/* gpio16_uart0_cts */
#define GPIO16_UART0_CTS \
	BFLB_PINMUX(16, uart0, cts, periph)

/* gpio16_uart0_tx */
#define GPIO16_UART0_TX \
	BFLB_PINMUX(16, uart0, tx, periph)

/* gpio16_uart0_rx */
#define GPIO16_UART0_RX \
	BFLB_PINMUX(16, uart0, rx, periph)

/* gpio16_pwm1_ch0 */
#define GPIO16_PWM1_CH0 \
	BFLB_PINMUX(16, pwm1, ch0, periph)

