zephyrproject-rtos/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl702lx-pinctrl.h
/* gpio16_jtag_tms */
#define GPIO16_JTAG_TMS \
	BFLB_PINMUX(16, jtag, tms, periph)

/* gpio17_clock_out1_f32k */
#define GPIO17_CLOCK_OUT1_F32K \
	BFLB_PINMUX(17, clock_out1, f32k, periph)

/* gpio17_clock_out1_xtal */
#define GPIO17_CLOCK_OUT1_XTAL \
	BFLB_PINMUX(17, clock_out1, xtal, periph)

/* gpio17_clock_out1_xtal32k */
#define GPIO17_CLOCK_OUT1_XTAL32K \
	BFLB_PINMUX(17, clock_out1, xtal32k, periph)

/* gpio17_spi_miso */
#define GPIO17_SPI_MISO \
	BFLB_PINMUX(17, spi, miso, periph)

/* gpio17_i2c_sda */
#define GPIO17_I2C_SDA \
	BFLB_PINMUX(17, i2c, sda, periph)

/* gpio17_uart0_rts */
#define GPIO17_UART0_RTS \
	BFLB_PINMUX(17, uart0, rts, periph)

/* gpio17_uart0_cts */
#define GPIO17_UART0_CTS \
	BFLB_PINMUX(17, uart0, cts, periph)

/* gpio17_uart0_tx */
#define GPIO17_UART0_TX \
	BFLB_PINMUX(17, uart0, tx, periph)

/* gpio17_uart0_rx */
#define GPIO17_UART0_RX \
	BFLB_PINMUX(17, uart0, rx, periph)

/* gpio17_pwm1_ch1 */
#define GPIO17_PWM1_CH1 \
	BFLB_PINMUX(17, pwm1, ch1, periph)

/* gpio17_jtag_tdi */
#define GPIO17_JTAG_TDI \
	BFLB_PINMUX(17, jtag, tdi, periph)

/* gpio17_adc_ch2 */
#define GPIO17_ADC_CH2 \
	BFLB_PINMUX(17, adc, ch2, analog)

/* gpio18_clock_out0_dll_2_032M */
#define GPIO18_CLOCK_OUT0_DLL_2_032M \
	BFLB_PINMUX(18, clock_out0, dll_2_032m, periph)

/* gpio18_clock_out0_dll_6_095M */
#define GPIO18_CLOCK_OUT0_DLL_6_095M \
	BFLB_PINMUX(18, clock_out0, dll_6_095m, periph)

/* gpio18_clock_out0_xclk */
#define GPIO18_CLOCK_OUT0_XCLK \
	BFLB_PINMUX(18, clock_out0, xclk, periph)

/* gpio18_spi_ss */
#define GPIO18_SPI_SS \
	BFLB_PINMUX(18, spi, ss, periph)

/* gpio18_i2c_scl */
#define GPIO18_I2C_SCL \
	BFLB_PINMUX(18, i2c, scl, periph)

/* gpio18_uart0_rts */
#define GPIO18_UART0_RTS \
	BFLB_PINMUX(18, uart0, rts, periph)

/* gpio18_uart0_cts */
#define GPIO18_UART0_CTS \
	BFLB_PINMUX(18, uart0, cts, periph)

/* gpio18_uart0_tx */
#define GPIO18_UART0_TX \
	BFLB_PINMUX(18, uart0, tx, periph)

/* gpio18_uart0_rx */
#define GPIO18_UART0_RX \
	BFLB_PINMUX(18, uart0, rx, periph)

/* gpio18_pwm1_ch2 */
#define GPIO18_PWM1_CH2 \
	BFLB_PINMUX(18, pwm1, ch2, periph)

/* gpio18_jtag_tck */
#define GPIO18_JTAG_TCK \
	BFLB_PINMUX(18, jtag, tck, periph)

/* gpio18_adc_ch3 */
#define GPIO18_ADC_CH3 \
	BFLB_PINMUX(18, adc, ch3, analog)

/* gpio22_clock_out0_dll_2_032M */
#define GPIO22_CLOCK_OUT0_DLL_2_032M \
	BFLB_PINMUX(22, clock_out0, dll_2_032m, periph)

/* gpio22_clock_out0_dll_6_095M */
#define GPIO22_CLOCK_OUT0_DLL_6_095M \
	BFLB_PINMUX(22, clock_out0, dll_6_095m, periph)

/* gpio22_clock_out0_xclk */
#define GPIO22_CLOCK_OUT0_XCLK \
	BFLB_PINMUX(22, clock_out0, xclk, periph)

/* gpio22_spi_ss */
#define GPIO22_SPI_SS \
	BFLB_PINMUX(22, spi, ss, periph)

/* gpio22_i2c_scl */
#define GPIO22_I2C_SCL \
	BFLB_PINMUX(22, i2c, scl, periph)

/* gpio22_uart0_rts */
#define GPIO22_UART0_RTS \
	BFLB_PINMUX(22, uart0, rts, periph)

/* gpio22_uart0_cts */
#define GPIO22_UART0_CTS \
	BFLB_PINMUX(22, uart0, cts, periph)

/* gpio22_uart0_tx */
#define GPIO22_UART0_TX \
	BFLB_PINMUX(22, uart0, tx, periph)

/* gpio22_uart0_rx */
#define GPIO22_UART0_RX \
	BFLB_PINMUX(22, uart0, rx, periph)

/* gpio22_pwm1_ch1 */
#define GPIO22_PWM1_CH1 \
	BFLB_PINMUX(22, pwm1, ch1, periph)

/* gpio22_jtag_tck */
#define GPIO22_JTAG_TCK \
	BFLB_PINMUX(22, jtag, tck, periph)

/* gpio23_clock_out1_f32k */
#define GPIO23_CLOCK_OUT1_F32K \
	BFLB_PINMUX(23, clock_out1, f32k, periph)

/* gpio23_clock_out1_xtal */
#define GPIO23_CLOCK_OUT1_XTAL \
	BFLB_PINMUX(23, clock_out1, xtal, periph)

/* gpio23_clock_out1_xtal32k */
#define GPIO23_CLOCK_OUT1_XTAL32K \
	BFLB_PINMUX(23, clock_out1, xtal32k, periph)

/* gpio23_sf2_d0 */
#define GPIO23_SF2_D0 \
	BFLB_PINMUX(23, sf2, d0, periph)

/* gpio23_spi_sclk */
#define GPIO23_SPI_SCLK \
	BFLB_PINMUX(23, spi, sclk, periph)

/* gpio23_i2c_sda */
#define GPIO23_I2C_SDA \
	BFLB_PINMUX(23, i2c, sda, periph)

/* gpio23_uart0_rts */
#define GPIO23_UART0_RTS \
	BFLB_PINMUX(23, uart0, rts, periph)

/* gpio23_uart0_cts */
#define GPIO23_UART0_CTS \
	BFLB_PINMUX(23, uart0, cts, periph)

/* gpio23_uart0_tx */
#define GPIO23_UART0_TX \
	BFLB_PINMUX(23, uart0, tx, periph)

/* gpio23_uart0_rx */
#define GPIO23_UART0_RX \
	BFLB_PINMUX(23, uart0, rx, periph)

/* gpio23_pwm1_ch2 */
#define GPIO23_PWM1_CH2 \
	BFLB_PINMUX(23, pwm1, ch2, periph)

/* gpio23_jtag_tdo */
#define GPIO23_JTAG_TDO \
	BFLB_PINMUX(23, jtag, tdo, periph)

/* gpio24_clock_out0_dll_2_032M */
#define GPIO24_CLOCK_OUT0_DLL_2_032M \
	BFLB_PINMUX(24, clock_out0, dll_2_032m, periph)

/* gpio24_clock_out0_dll_6_095M */
#define GPIO24_CLOCK_OUT0_DLL_6_095M \
	BFLB_PINMUX(24, clock_out0, dll_6_095m, periph)

/* gpio24_clock_out0_xclk */
#define GPIO24_CLOCK_OUT0_XCLK \
	BFLB_PINMUX(24, clock_out0, xclk, periph)

/* gpio24_sf2_d2 */
#define GPIO24_SF2_D2 \
	BFLB_PINMUX(24, sf2, d2, periph)

/* gpio24_spi_mosi */
#define GPIO24_SPI_MOSI \
	BFLB_PINMUX(24, spi, mosi, periph)

/* gpio24_i2c_scl */
#define GPIO24_I2C_SCL \
	BFLB_PINMUX(24, i2c, scl, periph)

/* gpio24_uart0_rts */
#define GPIO24_UART0_RTS \
	BFLB_PINMUX(24, uart0, rts, periph)

/* gpio24_uart0_cts */
#define GPIO24_UART0_CTS \
	BFLB_PINMUX(24, uart0, cts, periph)

/* gpio24_uart0_tx */
#define GPIO24_UART0_TX \
	BFLB_PINMUX(24, uart0, tx, periph)

/* gpio24_uart0_rx */
#define GPIO24_UART0_RX \
	BFLB_PINMUX(24, uart0, rx, periph)

/* gpio24_pwm1_ch3 */
#define GPIO24_PWM1_CH3 \
	BFLB_PINMUX(24, pwm1, ch3, periph)

/* gpio24_jtag_tms */
#define GPIO24_JTAG_TMS \
	BFLB_PINMUX(24, jtag, tms, periph)

/* gpio25_clock_out1_f32k */
#define GPIO25_CLOCK_OUT1_F32K \
	BFLB_PINMUX(25, clock_out1, f32k, periph)

/* gpio25_clock_out1_xtal */
#define GPIO25_CLOCK_OUT1_XTAL \
	BFLB_PINMUX(25, clock_out1, xtal, periph)

/* gpio25_clock_out1_xtal32k */
#define GPIO25_CLOCK_OUT1_XTAL32K \
	BFLB_PINMUX(25, clock_out1, xtal32k, periph)

/* gpio25_sf2_d1 */
#define GPIO25_SF2_D1 \
	BFLB_PINMUX(25, sf2, d1, periph)

/* gpio25_spi_miso */
#define GPIO25_SPI_MISO \
	BFLB_PINMUX(25, spi, miso, periph)

/* gpio25_i2c_sda */
#define GPIO25_I2C_SDA \
	BFLB_PINMUX(25, i2c, sda, periph)

/* gpio25_uart0_rts */
#define GPIO25_UART0_RTS \
	BFLB_PINMUX(25, uart0, rts, periph)

