zephyrproject-rtos/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl702lx-pinctrl.h
/* gpio25_uart0_cts */
#define GPIO25_UART0_CTS \
	BFLB_PINMUX(25, uart0, cts, periph)

/* gpio25_uart0_tx */
#define GPIO25_UART0_TX \
	BFLB_PINMUX(25, uart0, tx, periph)

/* gpio25_uart0_rx */
#define GPIO25_UART0_RX \
	BFLB_PINMUX(25, uart0, rx, periph)

/* gpio25_pwm0_ch0 */
#define GPIO25_PWM0_CH0 \
	BFLB_PINMUX(25, pwm0, ch0, periph)

/* gpio25_jtag_tdi */
#define GPIO25_JTAG_TDI \
	BFLB_PINMUX(25, jtag, tdi, periph)

/* gpio26_clock_out0_dll_2_032M */
#define GPIO26_CLOCK_OUT0_DLL_2_032M \
	BFLB_PINMUX(26, clock_out0, dll_2_032m, periph)

/* gpio26_clock_out0_dll_6_095M */
#define GPIO26_CLOCK_OUT0_DLL_6_095M \
	BFLB_PINMUX(26, clock_out0, dll_6_095m, periph)

/* gpio26_clock_out0_xclk */
#define GPIO26_CLOCK_OUT0_XCLK \
	BFLB_PINMUX(26, clock_out0, xclk, periph)

/* gpio26_sf2_cs */
#define GPIO26_SF2_CS \
	BFLB_PINMUX(26, sf2, cs, periph)

/* gpio26_spi_ss */
#define GPIO26_SPI_SS \
	BFLB_PINMUX(26, spi, ss, periph)

/* gpio26_i2c_scl */
#define GPIO26_I2C_SCL \
	BFLB_PINMUX(26, i2c, scl, periph)

/* gpio26_uart0_rts */
#define GPIO26_UART0_RTS \
	BFLB_PINMUX(26, uart0, rts, periph)

/* gpio26_uart0_cts */
#define GPIO26_UART0_CTS \
	BFLB_PINMUX(26, uart0, cts, periph)

/* gpio26_uart0_tx */
#define GPIO26_UART0_TX \
	BFLB_PINMUX(26, uart0, tx, periph)

/* gpio26_uart0_rx */
#define GPIO26_UART0_RX \
	BFLB_PINMUX(26, uart0, rx, periph)

/* gpio26_pwm1_ch0 */
#define GPIO26_PWM1_CH0 \
	BFLB_PINMUX(26, pwm1, ch0, periph)

/* gpio26_jtag_tck */
#define GPIO26_JTAG_TCK \
	BFLB_PINMUX(26, jtag, tck, periph)

/* gpio27_clock_out1_f32k */
#define GPIO27_CLOCK_OUT1_F32K \
	BFLB_PINMUX(27, clock_out1, f32k, periph)

/* gpio27_clock_out1_xtal */
#define GPIO27_CLOCK_OUT1_XTAL \
	BFLB_PINMUX(27, clock_out1, xtal, periph)

/* gpio27_clock_out1_xtal32k */
#define GPIO27_CLOCK_OUT1_XTAL32K \
	BFLB_PINMUX(27, clock_out1, xtal32k, periph)

/* gpio27_sf2_clk */
#define GPIO27_SF2_CLK \
	BFLB_PINMUX(27, sf2, clk, periph)

/* gpio27_spi_sclk */
#define GPIO27_SPI_SCLK \
	BFLB_PINMUX(27, spi, sclk, periph)

/* gpio27_i2c_sda */
#define GPIO27_I2C_SDA \
	BFLB_PINMUX(27, i2c, sda, periph)

/* gpio27_uart0_rts */
#define GPIO27_UART0_RTS \
	BFLB_PINMUX(27, uart0, rts, periph)

/* gpio27_uart0_cts */
#define GPIO27_UART0_CTS \
	BFLB_PINMUX(27, uart0, cts, periph)

/* gpio27_uart0_tx */
#define GPIO27_UART0_TX \
	BFLB_PINMUX(27, uart0, tx, periph)

/* gpio27_uart0_rx */
#define GPIO27_UART0_RX \
	BFLB_PINMUX(27, uart0, rx, periph)

/* gpio27_pwm1_ch1 */
#define GPIO27_PWM1_CH1 \
	BFLB_PINMUX(27, pwm1, ch1, periph)

/* gpio27_jtag_tdo */
#define GPIO27_JTAG_TDO \
	BFLB_PINMUX(27, jtag, tdo, periph)

/* gpio28_clock_out0_dll_2_032M */
#define GPIO28_CLOCK_OUT0_DLL_2_032M \
	BFLB_PINMUX(28, clock_out0, dll_2_032m, periph)

/* gpio28_clock_out0_dll_6_095M */
#define GPIO28_CLOCK_OUT0_DLL_6_095M \
	BFLB_PINMUX(28, clock_out0, dll_6_095m, periph)

/* gpio28_clock_out0_xclk */
#define GPIO28_CLOCK_OUT0_XCLK \
	BFLB_PINMUX(28, clock_out0, xclk, periph)

/* gpio28_sf2_d3 */
#define GPIO28_SF2_D3 \
	BFLB_PINMUX(28, sf2, d3, periph)

/* gpio28_spi_mosi */
#define GPIO28_SPI_MOSI \
	BFLB_PINMUX(28, spi, mosi, periph)

/* gpio28_i2c_scl */
#define GPIO28_I2C_SCL \
	BFLB_PINMUX(28, i2c, scl, periph)

/* gpio28_uart0_rts */
#define GPIO28_UART0_RTS \
	BFLB_PINMUX(28, uart0, rts, periph)

/* gpio28_uart0_cts */
#define GPIO28_UART0_CTS \
	BFLB_PINMUX(28, uart0, cts, periph)

/* gpio28_uart0_tx */
#define GPIO28_UART0_TX \
	BFLB_PINMUX(28, uart0, tx, periph)

/* gpio28_uart0_rx */
#define GPIO28_UART0_RX \
	BFLB_PINMUX(28, uart0, rx, periph)

/* gpio28_pwm1_ch2 */
#define GPIO28_PWM1_CH2 \
	BFLB_PINMUX(28, pwm1, ch2, periph)

/* gpio28_jtag_tms */
#define GPIO28_JTAG_TMS \
	BFLB_PINMUX(28, jtag, tms, periph)

/* gpio30_clock_out0_dll_2_032M */
#define GPIO30_CLOCK_OUT0_DLL_2_032M \
	BFLB_PINMUX(30, clock_out0, dll_2_032m, periph)

/* gpio30_clock_out0_dll_6_095M */
#define GPIO30_CLOCK_OUT0_DLL_6_095M \
	BFLB_PINMUX(30, clock_out0, dll_6_095m, periph)

/* gpio30_clock_out0_xclk */
#define GPIO30_CLOCK_OUT0_XCLK \
	BFLB_PINMUX(30, clock_out0, xclk, periph)

/* gpio30_spi_ss */
#define GPIO30_SPI_SS \
	BFLB_PINMUX(30, spi, ss, periph)

/* gpio30_i2c_scl */
#define GPIO30_I2C_SCL \
	BFLB_PINMUX(30, i2c, scl, periph)

/* gpio30_uart0_rts */
#define GPIO30_UART0_RTS \
	BFLB_PINMUX(30, uart0, rts, periph)

/* gpio30_uart0_cts */
#define GPIO30_UART0_CTS \
	BFLB_PINMUX(30, uart0, cts, periph)

/* gpio30_uart0_tx */
#define GPIO30_UART0_TX \
	BFLB_PINMUX(30, uart0, tx, periph)

/* gpio30_uart0_rx */
#define GPIO30_UART0_RX \
	BFLB_PINMUX(30, uart0, rx, periph)

/* gpio30_pwm0_ch0 */
#define GPIO30_PWM0_CH0 \
	BFLB_PINMUX(30, pwm0, ch0, periph)

/* gpio30_jtag_tck */
#define GPIO30_JTAG_TCK \
	BFLB_PINMUX(30, jtag, tck, periph)

/* gpio31_clock_out1_f32k */
#define GPIO31_CLOCK_OUT1_F32K \
	BFLB_PINMUX(31, clock_out1, f32k, periph)

/* gpio31_clock_out1_xtal */
#define GPIO31_CLOCK_OUT1_XTAL \
	BFLB_PINMUX(31, clock_out1, xtal, periph)

/* gpio31_clock_out1_xtal32k */
#define GPIO31_CLOCK_OUT1_XTAL32K \
	BFLB_PINMUX(31, clock_out1, xtal32k, periph)

/* gpio31_spi_sclk */
#define GPIO31_SPI_SCLK \
	BFLB_PINMUX(31, spi, sclk, periph)

/* gpio31_i2c_sda */
#define GPIO31_I2C_SDA \
	BFLB_PINMUX(31, i2c, sda, periph)

/* gpio31_uart0_rts */
#define GPIO31_UART0_RTS \
	BFLB_PINMUX(31, uart0, rts, periph)

/* gpio31_uart0_cts */
#define GPIO31_UART0_CTS \
	BFLB_PINMUX(31, uart0, cts, periph)

/* gpio31_uart0_tx */
#define GPIO31_UART0_TX \
	BFLB_PINMUX(31, uart0, tx, periph)

/* gpio31_uart0_rx */
#define GPIO31_UART0_RX \
	BFLB_PINMUX(31, uart0, rx, periph)

/* gpio31_pwm1_ch0 */
#define GPIO31_PWM1_CH0 \
	BFLB_PINMUX(31, pwm1, ch0, periph)

/* gpio31_jtag_tdo */
#define GPIO31_JTAG_TDO \
	BFLB_PINMUX(31, jtag, tdo, periph)

#endif /* DT_BINDINGS_PINCTRL_BFLB_BL702LX_PINCTRL_H_ */
